In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1, 2, np.nan],
                  'B':[5, np.nan, np.nan],
                  'C':[1, 2, 3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [6]:
df.dropna(thresh=2) # thresh 2 there are two or more values drop in row

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.fillna(value = "FILL VALUE")

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [10]:
df['A'].fillna(value = df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [11]:
V1 = np.array([2,3,5,np.NaN,7,1,np.NaN,10,14])
V2 = np.array([8,np.NaN,5,8,11,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,13,5,6,13,7,np.NaN,3,30])
df = pd.DataFrame(
        {"Var1" : V1,
         "Var2" : V2,
         "Var3" : V3}
)

In [23]:
df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [13]:
df.dropna(thresh=1)

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [14]:
df.dropna(thresh=2)

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [15]:
df.dropna(thresh=3)

   Var1  Var2  Var3
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [16]:
df.isnull().sum()

Var1    2
Var2    3
Var3    2
dtype: int64

In [17]:
len(df)

9

In [18]:
df.isnull().sum() / len(df) *100

Var1    22.222222
Var2    33.333333
Var3    22.222222
dtype: float64

In [20]:
df.notnull().sum()

Var1    7
Var2    6
Var3    7
dtype: int64

In [21]:
df.isnull().sum().sum() # Total null value numbers

7

In [22]:
df.isnull().any() # There is any null value checking. True there is null value

Var1    True
Var2    True
Var3    True
dtype: bool

In [26]:
df.isnull().any(axis=1)

0     True
1     True
2    False
3     True
4    False
5     True
6     True
7    False
8    False
dtype: bool

In [25]:
df[df.isnull().any(axis=1)] # Showing any non-value row

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
3   NaN   8.0   6.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN

In [30]:
df[df.notnull().all(axis=1)] # Attention all function all value True

   Var1  Var2  Var3
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [32]:
df[~df.isnull().any(axis=1)]

   Var1  Var2  Var3
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [33]:
df[df.Var1.notnull() & df.Var2.notnull() & df.Var3.notnull()]

   Var1  Var2  Var3
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [34]:
df.dropna()

   Var1  Var2  Var3
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [35]:
df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [36]:
df.dropna(how = "all")

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [37]:
df.dropna(axis = 1, how = "all")

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [38]:
df["delete_me"] = np.nan

In [39]:
df

   Var1  Var2  Var3  delete_me
0   2.0   8.0   NaN        NaN
1   3.0   NaN  13.0        NaN
2   5.0   5.0   5.0        NaN
3   NaN   8.0   6.0        NaN
4   7.0  11.0  13.0        NaN
5   1.0   NaN   7.0        NaN
6   NaN   NaN   NaN        NaN
7  10.0   2.0   3.0        NaN
8  14.0   3.0  30.0        NaN

In [40]:
df.dropna(axis = 1, how = "all")

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0